online_results/batching_results/opt-1.3b/_8__1000/log_12071293.out
WARNING 11-21 17:55:07 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=50563, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/batching_results/opt-1.3b/_8__1000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=50563 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b --max-num-seqs=8', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  118.13    
Total input tokens:                      242000    
Total generated tokens:                  226000    
Request throughput (req/s):              8.46      
Output token throughput (tok/s):         1913.09   
Total Token throughput (tok/s):          3961.61   
---------------Time to First Token----------------
Mean TTFT (ms):                          58802.53  
Median TTFT (ms):                        58840.53  
P99 TTFT (ms):                           116197.33 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.11      
Median TPOT (ms):                        4.09      
P99 TPOT (ms):                           4.81      
---------------Inter-token Latency----------------
Mean ITL (ms):                           4.10      
Median ITL (ms):                         4.08      
P99 ITL (ms):                            4.49      
==================================================
Concurrent checker terminated
Server terminated